In [1]:
import pandas as pd
import seaborn as sns

## Ethiopia Production

In [2]:
prod_df = pd.read_csv('./data/production.csv')

In [3]:
prod_df.shape

(56, 32)

In [4]:
prod_df = prod_df.T

In [5]:
e_prod = pd.DataFrame(prod_df)

In [6]:
header = e_prod.iloc[0]
e_prod = e_prod[1:]
e_prod.columns = header

In [7]:
#setting column name as the country names
e_prod.columns = e_prod.iloc[0]

In [8]:
# dropping first row
e_prod = e_prod.iloc[1:]

In [9]:
e_prod = e_prod[['Ethiopia']]

In [10]:
e_prod['year'] = e_prod.index

In [11]:
e_prod.columns = [col.lower().strip().replace(' ', '_')
    for col in e_prod.columns]

In [12]:
e_prod.head()

         ethiopia     year
1990/91  2909.451  1990/91
1991/92  2924.664  1991/92
1992/93  1825.171  1992/93
1993/94  2967.004  1993/94
1994/95   2762.73  1994/95

## Retail Prices

In [13]:
retail_prices = pd.read_excel('./data/3b - retail_prices.xlsx')

In [14]:
retail_prices.head()

,Year,Austria,Belgium,Bulgaria,Cyprus,Czechia,Denmark,Finland,France,Germany,...,Slovakia,Slovenia,Spain,Sweden,Japan,Norway,Russian Federation,Switzerland,United Kingdom 1,United States of America
0,1990,4.90,3.27,NaN,2.83,NaN,3.81,2.98,3.73,3.99,...,NaN,NaN,3.62,3.43,10.26,3.31,NaN,4.83,10.55,2.97
1,1991,4.57,2.92,NaN,2.80,NaN,3.67,2.72,3.43,3.84,...,NaN,NaN,3.50,3.29,11.88,3.16,NaN,4.36,10.41,2.81
2,1992,4.99,3.05,NaN,2.87,NaN,3.79,2.46,2.31,4.00,...,NaN,NaN,3.50,3.11,12.62,3.12,NaN,4.52,10.09,2.58
3,1993,4.97,2.78,NaN,2.60,NaN,3.48,1.94,2.03,3.62,...,NaN,NaN,2.79,2.65,14.57,2.46,NaN,4.27,8.44,2.47
4,1994,4.58,3.42,NaN,3.18,NaN,4.45,2.73,2.40,4.18,...,NaN,NaN,2.76,3.79,14.69,3.29,NaN,4.50,11.36,3.40

## Ethiopia Temp

In [15]:
temp_df = pd.read_csv('data/FAOSTAT_data_1-10-2022.csv')

In [16]:
ethiopia_temp_change = temp_df[temp_df.Area == 'Ethiopia']

In [17]:
ethiopia_temp_change.columns = [col.lower().strip().replace(' ', '_')
    for col in ethiopia_temp_change.columns]

In [18]:
ethiopia_temp_change = ethiopia_temp_change[ethiopia_temp_change['months']=='Meteorological year'].sort_values(by=['months', 'year'], ascending= False)

In [19]:
e_temp_change = ethiopia_temp_change[['year','value']].iloc[::-1]

In [20]:
e_temp_change.rename(columns={'value':'e_temp_change'}, inplace = True)

In [21]:
e_temp_change.head()

       year  e_temp_change
70182  1993          0.244
70183  1994          0.599
70184  1995          0.815
70185  1996          0.775
70186  1997          0.713

## Ethiopia Exports

In [22]:
e_export = pd.read_excel('./data/2a - Exports - calendar year.xlsx')

In [23]:
e_export.dropna(inplace = True)

In [24]:
e_export = e_export.T

In [25]:
new_header = e_export.iloc[0]
e_export = e_export[1:] 
e_export.columns = new_header

In [26]:
e_export.columns = [col.lower().strip().replace(' ','_') 
                         for col in e_export.columns]

In [27]:
e_export = e_export[['calendar_years','ethiopia']]

In [28]:
e_export.rename(columns={'calendar_years':'year', 'ethiopia':'e_export'}, inplace = True)

In [29]:
e_export.head()

              year  e_export
Unnamed: 1  1990.0  1074.101
Unnamed: 2  1991.0   841.329
Unnamed: 3  1992.0   734.461
Unnamed: 4  1993.0  1166.778
Unnamed: 5  1994.0  1475.325

## Ethiopia Domestic Consumption (Disappearance)

In [30]:
e_consumption = pd.read_excel('./data/1b - Domestic consumption.xlsx')

/Users/sangs/opt/anaconda3/lib/python3.9/site-packages/openpyxl/worksheet/_reader.py:312: UserWarning: Unknown extension is not supported and will be removed
  warn(msg)

In [31]:
e_consumption = e_consumption.T

In [32]:
new_header = e_consumption.iloc[0]
e_consumption = e_consumption[1:] 
e_consumption.columns = new_header

In [33]:
e_consumption = e_consumption.drop(e_consumption.index[:1])

In [34]:
e_consumption.head()

Domestic consumption by all exporting countries,In thousand 60kg bags,NaN,Crop year,NaN,April group,Angola,Bolivia (Plurinational State of),Brazil,Burundi,Ecuador,...,Thailand,Togo,Trinidad & Tobago,Uganda,Venezuela,Viet Nam,Yemen,NaN,Total,© International Coffee Organization
Unnamed: 2,NaN,NaN,1990/91,NaN,10408,20,25,8200,2,350,...,188,1,8,70,782.39,150,0,NaN,19509.211,NaN
Unnamed: 3,NaN,NaN,1991/92,NaN,10707.6,30,27,8500,1.6,350,...,220,1,11.5,75,815.48,230,0,NaN,20228.097,NaN
Unnamed: 4,NaN,NaN,1992/93,NaN,11212.2,35,27.5,8900,1.7,350,...,233,1,10,75,849.97,250,0,NaN,20951.452,NaN
Unnamed: 5,NaN,NaN,1993/94,NaN,11452.743,20,28.5,9100,1.91,350,...,250,1,10,75,885.93,267,0,NaN,21097.906,NaN
Unnamed: 6,NaN,NaN,1994/95,NaN,11506.499,25,29.5,9300,2,350,...,283,1,14,80,923.4,267,0,NaN,21360.166,NaN

In [35]:
e_consumption = e_consumption.drop(e_consumption.columns[:2], axis = 1)

In [36]:
e_consumption = e_consumption[['Crop year','Ethiopia']]

In [37]:
e_consumption.columns = [col.lower().strip().replace(' ','_') 
                         for col in e_consumption.columns]

In [38]:
e_consumption.rename(columns = {'crop_year':'year',
                                'ethiopia':'e_consumption'},
                     inplace = True)

In [39]:
e_consumption.head()

               year e_consumption
Unnamed: 2  1990/91          1200
Unnamed: 3  1991/92          1264
Unnamed: 4  1992/93          1331
Unnamed: 5  1993/94          1402
Unnamed: 6  1994/95          1476

## Merge dataframes

e_prod
e_temp_change
e_export
e_consumption

In [40]:
prod_temp_df = pd.concat([e_prod, e_temp_change])

In [41]:
export_consump = pd.concat([e_export, e_consumption])

In [42]:
e_df

                year     e_export e_consumption
Unnamed: 1    1990.0     1074.101           NaN
Unnamed: 2    1991.0      841.329           NaN
Unnamed: 3    1992.0      734.461           NaN
Unnamed: 4    1993.0     1166.778           NaN
Unnamed: 5    1994.0     1475.325           NaN
Unnamed: 6    1995.0     1276.118           NaN
Unnamed: 7    1996.0     1838.231           NaN
Unnamed: 8    1997.0     1979.733           NaN
Unnamed: 9    1998.0     1917.061           NaN
Unnamed: 10   1999.0     1818.087           NaN
Unnamed: 11   2000.0     1981.856           NaN
Unnamed: 12   2001.0     1376.062           NaN
Unnamed: 13   2002.0     2054.678           NaN
Unnamed: 14   2003.0     2229.143           NaN
Unnamed: 15   2004.0     2490.944           NaN
Unnamed: 16   2005.0     2435.069           NaN
Unnamed: 17   2006.0      2935.56           NaN
Unnamed: 18   2007.0     2604.008           NaN
Unnamed: 19   2008.0   2851.92097           NaN
Unnamed: 20   2009.0  1851.497453           NaN
Unnamed: 21   2010.0  3324.102551           NaN
Unnamed: 22   2011.0  2675.419013           NaN
Unnamed: 23   2012.0  3202.592407           NaN
Unnamed: 24   2013.0  2870.075248           NaN
Unnamed: 25   2014.0   3116.69037           NaN
Unnamed: 26   2015.0  2984.974817           NaN
Unnamed: 27   2016.0   3000.72445           NaN
Unnamed: 28   2017.0  3773.406333           NaN
Unnamed: 29   2018.0   3589.04802           NaN
Unnamed: 30   2019.0  3921.249773           NaN
Unnamed: 2   1990/91          NaN          1200
Unnamed: 3   1991/92          NaN          1264
Unnamed: 4   1992/93          NaN          1331
Unnamed: 5   1993/94          NaN          1402
Unnamed: 6   1994/95          NaN          1476
Unnamed: 7   1995/96          NaN          1555
Unnamed: 8   1996/97          NaN          1637
Unnamed: 9   1997/98          NaN          1724
Unnamed: 10  1998/99          NaN          1816
Unnamed: 11  1999/00          NaN          1912
Unnamed: 12  2000/01          NaN          2014
Unnamed: 13  2001/02          NaN          2121
Unnamed: 14  2002/03          NaN          2234
Unnamed: 15  2003/04          NaN          2353
Unnamed: 16  2004/05          NaN          2478
Unnamed: 17  2005/06          NaN          2609
Unnamed: 18  2006/07          NaN          2748
Unnamed: 19  2007/08          NaN          2894
Unnamed: 20  2008/09          NaN          3048
Unnamed: 21  2009/10          NaN          3109
Unnamed: 22  2010/11          NaN          3171
Unnamed: 23  2011/12          NaN          3235
Unnamed: 24  2012/13          NaN          3299
Unnamed: 25  2013/14          NaN          3365
Unnamed: 26  2014/15          NaN          3433
Unnamed: 27  2015/16          NaN          3501
Unnamed: 28  2016/17          NaN          3571
Unnamed: 29  2017/18          NaN          3643
Unnamed: 30  2018/19          NaN          3685
Unnamed: 31  2019/20          NaN          3781